[
  {
  "category": "Latest",
  "title": "RRB Group D Recruitment 2026 (22,000 Posts)",
  "organization": "Railway Recruitment Board",
  "qualification": "10th Pass / ITI",
  "lastdate": "02 March 2026",
  "description": "OVERVIEW:\nThe Railway Recruitment Board (RRB) has released the official notification for RRB Group D Recruitment 2026 under advertisement CEN 09/2025. This is one of the biggest government job opportunities in India with approximately 22,000 Level-1 posts available across various departments of Indian Railways. Candidates from all over the country can apply online for vacancies such as Track Maintainer, Assistant (P‑way), Assistant (TRD), Assistant Loco Shed, Assistant Operations, Pointsman B and more. Online applications started from late January 2026 and will continue for a specified period.\n\nPOSTS & VACANCIES:\n• Total Vacancies: ~22,000 Level‑1 Posts including:\n  – Track Maintainer (Group IV)\n  – Pointsman B\n  – Assistant (S & T)\n  – Assistant (C & W)\n  – Assistant (Track Machine)\n  – Assistant (Bridge)\n  – Assistant (TRD)\n  – Assistant Loco Shed (Electrical)\n  – Assistant Operations (Electrical)\n  – Assistant (TL & AC)\n(Exact numbers per post are announced in the detailed official notification)\n\nELIGIBILITY CRITERIA:\n• Minimum Qualification: 10th Pass or ITI from a recognized board / institution OR a National Apprenticeship Certificate (NAC) granted by NCVT/SCVT.\n• Age Limit: 18 to 33 years (upper age may be relaxed for OBC/SC/ST as per rules).\n• Nationality: Indian citizens are eligible.\n\nAPPLICATION PROCESS:\n• Mode of Apply: Online only via official RRB websites.\n• Application Start Date: 31 January 2026 (varies site to site).\n• Last Date to Apply: 02 March 2026 (the final date as per notification).\n\nSELECTION PROCESS:\nThe selection will be based on multiple stages including:\n• Computer Based Test (CBT) to assess basic aptitude and knowledge\n• Physical Efficiency Test (PET) for eligible candidates\n• Document Verification and Medical Examination in later stages.\n\nSALARY & BENEFITS:\n• The initial pay for RRB Group D is based on the 7th CPC Pay Matrix with a basic salary starting around ₹18,000 per month plus allowances which include dearness allowance (DA), travel allowance (TA), house rent allowance (HRA) and other perks typical for Central Government jobs.\n\nPREPARATION & TIPS:\nCandidates should prepare for the CBT exam by studying previous year papers, general knowledge, mathematics and reasoning. Physical preparation is also recommended for the PET stage, which includes running, lifting and endurance tasks. Authorized practice books and test series help build confidence.\n\n--------------------------------------\nहिंदी विवरण:\nरेलवे भर्ती बोर्ड (RRB) ने ग्रुप D भर्ती 2026 के लिए आधिकारिक अधिसूचना जारी कर दी है। इस भर्ती के तहत भारतीय रेलवे में लगभग 22,000 लेवल‑1 पद भरे जाएंगे। इन पदों में ट्रैक मेंटेनर, पॉइंट्समैन, असिस्टेंट (S & T), असिस्टेंट (C & W), असिस्टेंट TRD, असिस्टेंट लोको शेड (इलेक्ट्रिकल), असिस्टेंट ऑपरेशंस (इलेक्ट्रिकल) आदि शामिल हैं।\n\nउम्मीदवारों को 10वीं कक्षा पास या मान्यता प्राप्त बोर्ड से ITI या राष्ट्रीय अप्रेंटिसशिप सर्टिफिकेट (NAC) होना अनिवार्य है। उम्र सीमा सामान्य श्रेणी के लिए 18 से 33 वर्ष होती है, जबकि आरक्षित वर्गों के लिए नियमों के अनुसार छूट दी जाती है।\n\nचयन प्रक्रिया में पहले कंप्यूटर बेस्ड परीक्षा (CBT) होगी, उसके बाद शारीरिक दक्षता परीक्षा (PET), दस्तावेज सत्यापन और मेडिकल जांच शामिल है। उम्मीदवारों को सलाह दी जाती है कि वे आधिकारिक नोटिफिकेशन को ध्यानपूर्वक पढ़ें और परीक्षा के अनुसार तैयारी करें।\n\nइस भर्ती में चयनित उम्मीदवारों को 7वें वेतन आयोग के तहत करीब ₹18,000 प्रतिमाह मूल वेतन के साथ भत्ते भी मिलेंगे। भारतीय रेलवे नौकरी में स्थिरता, सामाजिक सम्मान और कैरियर ग्रोथ के अवसर हैं।\n\nOFFICIAL WEBSITE: https://rrbcdg.gov.in",
  "link": "https://rrbcdg.gov.in"
}
  },

  {
    "category": "Latest",
    "title": "Indian Air Force Agniveer Vayu Intake 01/2027 Recruitment",
    "organization": "Indian Air Force",
    "qualification": "10+2 (Science) / Diploma / Vocational Course",
    "lastdate": "01 February 2026",
    "description": "Indian Air Force has officially released the recruitment notification for Agniveer Vayu Intake 01/2027 under the Agnipath Scheme. This recruitment is conducted to enroll young and motivated candidates into the Indian Air Force for a service period of four years.\n\nThe selection process includes an online written examination, Physical Fitness Test (PFT), Adaptability Tests and Medical Examination. Selected candidates will receive monthly salary, allowances and a Seva Nidhi package after completion of service tenure.\n\nApplicants are advised to read the official notification carefully before applying to understand eligibility conditions, physical standards and selection rules.\n\n--------------------------------------\n\nहिंदी विवरण:\n\nभारतीय वायुसेना ने अग्निपथ योजना के अंतर्गत अग्निवीर वायु इंटेक 01/2027 के लिए आधिकारिक भर्ती अधिसूचना जारी कर दी है। इस भर्ती के माध्यम से योग्य एवं युवा उम्मीदवारों को चार वर्षों की सेवा अवधि के लिए भारतीय वायुसेना में शामिल किया जाएगा।\n\nचयन प्रक्रिया में ऑनलाइन लिखित परीक्षा, शारीरिक दक्षता परीक्षा, अनुकूलन परीक्षा और मेडिकल परीक्षण शामिल हैं। चयनित उम्मीदवारों को सेवा अवधि के दौरान वेतन, भत्ते तथा सेवा निधि पैकेज का लाभ मिलेगा।\n\nउम्मीदवारों को आवेदन करने से पहले आधिकारिक अधिसूचना को ध्यानपूर्वक पढ़ने की सलाह दी जाती है।",
    "link": "https://agnipathvayu.cdac.in"
  },

  {
    "category": "Latest",
    "title": "RBI Office Assistant Recruitment 2026",
    "organization": "Reserve Bank of India",
    "qualification": "10th / 12th Pass",
    "lastdate": "15 February 2026",
    "description": "Reserve Bank of India (RBI) has released the Office Assistant recruitment notification for 2026. This recruitment provides an excellent opportunity to work in India's central banking institution.\n\nThe selection process generally includes a written examination, interview and document verification. Selected candidates will receive an attractive salary, job security and other government benefits.\n\n--------------------------------------\n\nहिंदी विवरण:\n\nभारतीय रिज़र्व बैंक (RBI) द्वारा ऑफिस असिस्टेंट पदों के लिए भर्ती अधिसूचना जारी की गई है। यह भारत की सबसे प्रतिष्ठित बैंकिंग संस्थाओं में से एक में कार्य करने का अवसर प्रदान करती है।\n\nचयन प्रक्रिया में लिखित परीक्षा, साक्षात्कार और दस्तावेज सत्यापन शामिल हो सकता है। चयनित उम्मीदवारों को अच्छा वेतन, स्थायी नौकरी और अन्य सरकारी सुविधाएं प्राप्त होंगी।",
    "link": "https://rbi.org.in"
  },

  {
    "category": "Punjab",
    "title": "PSSSB Group D Recruitment 2026",
    "organization": "Punjab Subordinate Services Selection Board",
    "qualification": "10th Pass with Punjabi",
    "lastdate": "26 January 2026",
    "description": "Punjab Subordinate Services Selection Board (PSSSB) has released Group D recruitment notification for various departments of Punjab Government.\n\nThe selection process includes a written examination followed by document verification. Knowledge of Punjabi language is mandatory.\n\n--------------------------------------\n\nहिंदी विवरण:\n\nपंजाब अधीनस्थ सेवा चयन बोर्ड (PSSSB) द्वारा ग्रुप D पदों के लिए भर्ती अधिसूचना जारी की गई है। यह भर्ती पंजाब सरकार के विभिन्न विभागों में की जाएगी।\n\nचयन प्रक्रिया में लिखित परीक्षा और दस्तावेज सत्यापन शामिल होगा। उम्मीदवार का पंजाबी भाषा का ज्ञान होना अनिवार्य है।",
    "link": "https://sssb.punjab.gov.in"
  },

  {
    "category": "Admit Card",
    "title": "CTET Admit Card 2026 Released",
    "organization": "CBSE",
    "qualification": "CTET Paper I & II",
    "lastdate": "As per admit card",
    "description": "Central Teacher Eligibility Test (CTET) 2026 admit card has been released. Candidates can download their admit card using application number and date of birth.\n\nThe admit card contains important details such as exam date, timing, exam centre and instructions.\n\n--------------------------------------\n\nहिंदी विवरण:\n\nकेंद्रीय शिक्षक पात्रता परीक्षा (CTET) 2026 का एडमिट कार्ड जारी कर दिया गया है। उम्मीदवार आवेदन संख्या और जन्म तिथि की सहायता से एडमिट कार्ड डाउनलोड कर सकते हैं।\n\nएडमिट कार्ड में परीक्षा की तिथि, समय, परीक्षा केंद्र और महत्वपूर्ण निर्देश दिए गए हैं।",
    "link": "https://ctet.nic.in"
  },
{{
  "recruitment_name": "RRB Group D Recruitment 2026",
  "organization": "Railway Recruitment Board (RRB)",
  "ministry": "Ministry of Railways, Government of India",
  "cen_number": "CEN 09/2025",
  "post_level": "Level-1",
  "total_vacancies": 22000,
  "job_type": "Permanent Government Job",
  "job_location": "All India",
  "important_dates": {
    "notification_release": "December 2025",
    "application_start_date": "31 January 2026",
    "application_last_date": "02 March 2026",
    "exam_date": "To be announced",
    "admit_card": "Before exam date"
  },
  "eligibility": {
    "education": [
      "10th Pass (Matriculation)",
      "ITI from NCVT/SCVT",
      "National Apprenticeship Certificate (NAC)"
    ],
    "age_limit": {
      "minimum_age": 18,
      "maximum_age": 33,
      "age_calculation_date": "01 January 2026",
      "age_relaxation": "As per Government rules"
    },
    "nationality": "Indian"
  },
  "selection_process": [
    "Computer Based Test (CBT)",
    "Physical Efficiency Test (PET)",
    "Document Verification (DV)",
    "Medical Examination"
  ],
  "salary": {
    "pay_level": "Level-1",
    "basic_pay": 18000,
    "allowances": "As per Railway rules"
  },
  "application_fee": {
    "general_obc_ews": 500,
    "sc_st_pwd_women_transgender": 250,
    "refund_policy": "Fee partially/refully refundable after CBT"
  },
  "application_mode": "Online",
  "official_website": "https://www.rrbapply.gov.in",
  "current_status": "Applications open / ongoing",
  "notes": [
    "Check official notification for exact details",
    "Apply before last date to avoid server issues",
    "Aadhaar details should match 10th certificate"
}
]
