[
  {
    "category": "Latest",
    "title": "RRB Group D Recruitment 2026",
    "organization": "Railway Recruitment Board (RRB)",
    "qualification": "10th Pass / ITI",
    "lastdate": "Application starts from 30 January 2026",
    "description": "Railway Recruitment Board (RRB) has announced Group D (Level-1) recruitment for Indian Railways.\n\nPosts Included: Track Maintainer, Helper, Assistant Pointsman and other technical and non-technical posts across various railway zones.\n\nEligibility Criteria: Candidates must have passed 10th class or possess ITI from a recognized board. Age limit and category-wise relaxation will be applicable as per RRB rules.\n\nSelection Process: Selection will be based on Computer Based Test (CBT), Physical Efficiency Test (PET), Document Verification and Medical Examination.\n\nImportant Note: Candidates should carefully read the official notification before applying. Final selection will be strictly according to RRB recruitment norms.",
    "link": "https://www.rrbapply.gov.in"
  },
  {
    "category": "Latest",
    "title": "RBI Office Assistant Recruitment 2026",
    "organization": "Reserve Bank of India",
    "qualification": "10th / 12th Pass",
    "lastdate": "15 February 2026",
    "description": "Reserve Bank of India (RBI) has released the Office Assistant recruitment notification for 2026.\n\nPost Details: Office Assistant (Support Staff) in various RBI regional offices.\n\nEligibility Criteria: Candidates must have passed 10th or 12th class from a recognized board. Knowledge of local language is required.\n\nSelection Process: Selection will be done through Written Examination followed by Language Proficiency Test (LPT).\n\nImportant Note: Candidates must apply online only through the official RBI website. Selection will be purely merit-based.",
    "link": "https://rbi.org.in"
  },
  {
    "category": "Punjab",
    "title": "PSSSB Group D Recruitment 2026",
    "organization": "Punjab Subordinate Services Selection Board",
    "qualification": "10th Pass with Punjabi",
    "lastdate": "26 January 2026",
    "description": "Punjab Subordinate Services Selection Board (PSSSB) has released Group D recruitment notification for various departments of Punjab Government.\n\nPosts Included: Peon, Chowkidar, Helper and other Class IV posts.\n\nEligibility Criteria: Candidates must have passed 10th class with Punjabi as a subject. Age limit will be applicable as per Punjab Government rules.\n\nSelection Process: Selection will be based on Written Examination followed by Document Verification.\n\nImportant Note: Candidates are advised to check category-wise vacancy details before applying.",
    "link": "https://sssb.punjab.gov.in"
  },
  {
    "category": "Admit Card",
    "title": "CTET Admit Card 2026 Released",
    "organization": "Central Board of Secondary Education (CBSE)",
    "qualification": "For CTET Paper I & II Candidates",
    "lastdate": "Exam date as per admit card",
    "description": "Central Board of Secondary Education (CBSE) has released the CTET 2026 Admit Card.\n\nExam Details: CTET Paper I and Paper II will be conducted as per the schedule mentioned on the admit card.\n\nHow to Download: Candidates can download their admit card using application number and date of birth.\n\nImportant Instructions: Candidates must carry a printed admit card along with a valid photo ID to the examination centre.",
    "link": "https://ctet.nic.in"
  },
  {
    "category": "Admit Card",
    "title": "PSSSB Group D Admit Card 2025",
    "organization": "PSSSB Punjab",
    "qualification": "-",
    "lastdate": "-",
    "description": "Punjab Subordinate Services Selection Board (PSSSB) has released the Group D examination admit card.\n\nExam Details: Admit card contains exam date, time and exam centre information.\n\nImportant Note: Candidates must download and print the admit card before the examination date.",
    "link": "https://sssb.punjab.gov.in"
  },
  {
    "category": "Result",
    "title": "Punjab Police Constable Result 2025",
    "organization": "Punjab Police",
    "qualification": "-",
    "lastdate": "-",
    "description": "Punjab Police has declared the Constable examination result 2025.\n\nResult Details: Candidates can check their result using roll number or registration details.\n\nNext Step: Shortlisted candidates will be called for the next stage as per Punjab Police recruitment process.",
    "link": "https://punjabpolice.gov.in"
  },
  {
    "category": "Punjab",
    "title": "PSSSB Clerk Recruitment 2026",
    "organization": "PSSSB Punjab",
    "qualification": "Graduation with Computer Certificate",
    "lastdate": "28 January 2026",
    "description": "Punjab Subordinate Services Selection Board (PSSSB) has released Clerk and Clerk (IT) recruitment notification 2026.\n\nPost Details: Clerk and Clerk (IT) under Group C category.\n\nEligibility Criteria: Candidates must have Graduation along with Computer Certificate or Computer as a subject.\n\nSelection Process: Written Examination followed by Typing Test and Document Verification.",
    "link": "https://sssb.punjab.gov.in/vacancy/?key=vacancy_group_c&value=1129"
  },
  {
    "category": "Latest",
    "title": "Indian Air Force Agniveer Vayu Intake 01/2027 Recruitment",
    "organization": "Indian Air Force",
    "qualification": "10+2 Science / Diploma / Vocational",
    "lastdate": "01 February 2026",
    "description": "Indian Air Force has released the Agniveer Vayu Intake 01/2027 notification under the Agnipath Scheme.\n\nService Period: Selected candidates will serve for a period of 4 years.\n\nEligibility Criteria: 10+2 with Physics and Mathematics OR 3 Year Diploma in Engineering OR 2 Year Vocational Course.\n\nSelection Process: Online Written Test, Physical Fitness Test (PFT), Adaptability Tests and Medical Examination.\n\nImportant Note: Only unmarried male and female candidates are eligible to apply.",
    "link": "https://agnipathvayu.cdac.in"
  }
]
