[
  {
  "category": "Latest",
  "title": "RRB Group D Recruitment 2026 (22,000 Posts)",
  "organization": "Railway Recruitment Board",
  "qualification": "10th Pass / ITI",
  "lastdate": "02 March 2026",
  "description": "OVERVIEW:\nThe Railway Recruitment Board (RRB) has released the official notification for RRB Group D Recruitment 2026 under advertisement CEN 09/2025. This is one of the biggest government job opportunities in India with approximately 22,000 Level-1 posts available across various departments of Indian Railways. Candidates from all over the country can apply online for vacancies such as Track Maintainer, Assistant (P‑way), Assistant (TRD), Assistant Loco Shed, Assistant Operations, Pointsman B and more. Online applications started from late January 2026 and will continue for a specified period.\n\nPOSTS & VACANCIES:\n• Total Vacancies: ~22,000 Level‑1 Posts including:\n  – Track Maintainer (Group IV)\n  – Pointsman B\n  – Assistant (S & T)\n  – Assistant (C & W)\n  – Assistant (Track Machine)\n  – Assistant (Bridge)\n  – Assistant (TRD)\n  – Assistant Loco Shed (Electrical)\n  – Assistant Operations (Electrical)\n  – Assistant (TL & AC)\n(Exact numbers per post are announced in the detailed official notification)\n\nELIGIBILITY CRITERIA:\n• Minimum Qualification: 10th Pass or ITI from a recognized board / institution OR a National Apprenticeship Certificate (NAC) granted by NCVT/SCVT.\n• Age Limit: 18 to 33 years (upper age may be relaxed for OBC/SC/ST as per rules).\n• Nationality: Indian citizens are eligible.\n\nAPPLICATION PROCESS:\n• Mode of Apply: Online only via official RRB websites.\n• Application Start Date: 31 January 2026 (varies site to site).\n• Last Date to Apply: 02 March 2026 (the final date as per notification).\n\nSELECTION PROCESS:\nThe selection will be based on multiple stages including:\n• Computer Based Test (CBT) to assess basic aptitude and knowledge\n• Physical Efficiency Test (PET) for eligible candidates\n• Document Verification and Medical Examination in later stages.\n\nSALARY & BENEFITS:\n• The initial pay for RRB Group D is based on the 7th CPC Pay Matrix with a basic salary starting around ₹18,000 per month plus allowances which include dearness allowance (DA), travel allowance (TA), house rent allowance (HRA) and other perks typical for Central Government jobs.\n\nPREPARATION & TIPS:\nCandidates should prepare for the CBT exam by studying previous year papers, general knowledge, mathematics and reasoning. Physical preparation is also recommended for the PET stage, which includes running, lifting and endurance tasks. Authorized practice books and test series help build confidence.\n\n--------------------------------------\nहिंदी विवरण:\nरेलवे भर्ती बोर्ड (RRB) ने ग्रुप D भर्ती 2026 के लिए आधिकारिक अधिसूचना जारी कर दी है। इस भर्ती के तहत भारतीय रेलवे में लगभग 22,000 लेवल‑1 पद भरे जाएंगे। इन पदों में ट्रैक मेंटेनर, पॉइंट्समैन, असिस्टेंट (S & T), असिस्टेंट (C & W), असिस्टेंट TRD, असिस्टेंट लोको शेड (इलेक्ट्रिकल), असिस्टेंट ऑपरेशंस (इलेक्ट्रिकल) आदि शामिल हैं।\n\nउम्मीदवारों को 10वीं कक्षा पास या मान्यता प्राप्त बोर्ड से ITI या राष्ट्रीय अप्रेंटिसशिप सर्टिफिकेट (NAC) होना अनिवार्य है। उम्र सीमा सामान्य श्रेणी के लिए 18 से 33 वर्ष होती है, जबकि आरक्षित वर्गों के लिए नियमों के अनुसार छूट दी जाती है।\n\nचयन प्रक्रिया में पहले कंप्यूटर बेस्ड परीक्षा (CBT) होगी, उसके बाद शारीरिक दक्षता परीक्षा (PET), दस्तावेज सत्यापन और मेडिकल जांच शामिल है। उम्मीदवारों को सलाह दी जाती है कि वे आधिकारिक नोटिफिकेशन को ध्यानपूर्वक पढ़ें और परीक्षा के अनुसार तैयारी करें।\n\nइस भर्ती में चयनित उम्मीदवारों को 7वें वेतन आयोग के तहत करीब ₹18,000 प्रतिमाह मूल वेतन के साथ भत्ते भी मिलेंगे। भारतीय रेलवे नौकरी में स्थिरता, सामाजिक सम्मान और कैरियर ग्रोथ के अवसर हैं।\n\nOFFICIAL WEBSITE: https://rrbcdg.gov.in",
  "link": "https://rrbcdg.gov.in"
}
]
