[
  {
    "category": "Latest",
    "title": "RRB Group D Recruitment 2026 (22,000 Posts)",
    "organization": "Railway Recruitment Board (RRB)",
    "qualification": "10th Pass / ITI / NAC",
    "lastdate": "02 March 2026",
    "description": "OVERVIEW:\nThe Railway Recruitment Board (RRB) has released the official notification for RRB Group D Recruitment 2026 (Advt No. CEN 09/2025). This recruitment drive includes approximately 22,000 Level‑1 posts across various Indian Railway departments. Vacancies include Track Maintainer (Group IV), Pointsman B, Assistant (S&T), Assistant (C&W), Assistant (TRD), Assistant Loco Shed (Electrical), Assistant Operations (Electrical), and more. Candidates from all over India can apply online through the official RRB portals.\n\nVACANCIES (APPROX):\n• Track Maintainer (Group IV) – 11,000\n• Pointsman B – 5,000\n• Assistant (S & T) – 1,500\n• Assistant (C & W) – 1,000\n• Assistant (TRD) – 800\n• Assistant (Track Machine) – 600\n• Assistant (Bridge) – 600\n• Assistant Operations (Electrical) – 500\n• Assistant Loco Shed (Electrical) – 200\n• Assistant (TL & AC) – 50\n(Total ~22,000) 4\n\nELIGIBILITY:\n• Minimum Qualification: 10th pass or ITI from a recognized board/institution or National Apprenticeship Certificate (NAC). 5\n• Age: 18–33 years (age relaxation as per government rules). 6\n\nAPPLICATION & IMPORTANT DATES:\n• Mode: Online only via official RRB websites. 7\n• Apply Start: 21 January 2026. 8\n• Last Date to Apply: 02 March 2026. 9\n\nSELECTION PROCESS:\nThe selection includes Computer Based Test (CBT), Physical Efficiency Test (PET), Document Verification, and Medical Examination. 10\n\nSALARY & BENEFITS:\nSelected candidates will get a basic salary around ₹18,000 per month plus allowances (Dearness Allowance, House Rent Allowance, Travel Allowance). 11\n\nPREPARATION TIPS:\nCandidates should prepare with previous year papers, practice general knowledge, reasoning and mathematics for CBT, and physical fitness for PET.\n\nहिंदी विवरण:\nरेलवे भर्ती बोर्ड (RRB) ने ग्रुप D भर्ती 2026 के लिए आधिकारिक अधिसूचना जारी की है। लगभग 22,000 लेवल‑1 पदों के लिए आवेदन ऑनलाइन शुरू हो चुके हैं। योग्यता में 10वीं/ITI/NAC होना आवश्यक है। चयन कंप्यूटर आधारित परीक्षा, फिजिकल टेस्ट, दस्तावेज सत्यापन और मेडिकल के आधार पर होगा। वेतन लगभग ₹18,000 + भत्ते हैं। आधिकारिक वेबसाइट से ही आवेदन करें।",
    "link": "https://www.rrbapply.gov.in"
  },
  {
    "category": "Latest",
    "title": "RBI Office Attendant Recruitment 2026 (572 Posts)",
    "organization": "Reserve Bank of India (RBI)",
    "qualification": "10th Pass",
    "lastdate": "04 February 2026",
    "description": "OVERVIEW:\nThe Reserve Bank of India (RBI) has released the Office Attendant Recruitment 2026 notification inviting applications for 572 vacancies of Office Attendant posts across various RBI offices in India. Eligible candidates can apply online on the official RBI portal from 15 January to 04 February 2026. 12\n\nELIGIBILITY:\n• Minimum Qualification: 10th pass from a recognized board. 13\n• Age Limit: Typically 18 to 25 years (relaxation as per RBI norms). 14\n• Local language proficiency needed for the applying office/region. 15\n\nSELECTION PROCESS:\nSelection involves an Online Written Test followed by a Language Proficiency Test (LPT). Final merit will be based on Online Test performance, with LPT as qualifying stage. 16\n\nSALARY & BENEFITS:\nThe RBI Office Attendant 2026 salary includes a competitive pay scale with gross monthly emoluments around ₹26,500–₹46,000 approximately, including basic pay and allowances. 17\n\nAPPLICATION PROCESS:\nApply online via RBI official website within the specified dates. Check eligibility, fee details, and syllabus in the official notification PDF.\n\nहिंदी विवरण:\nभारतीय रिज़र्व बैंक (RBI) ने ऑफिस अटेंडेंट भर्ती 2026 के लिए आधिकारिक अधिसूचना जारी की है। 572 पदों के लिए आवेदन 15 जनवरी से 04 फरवरी तक किया जा सकता है। उम्मीदवार 10वीं पास होना चाहिए। चयन में ऑनलाइन परीक्षा और भाषा दक्षता परीक्षा शामिल है। वेतन ₹26,500–₹46,000 (अनुमानित) है।",
    "link": "https://www.rbi.org.in"
  },
  {
    "category": "Punjab",
    "title": "PSSSB Group D Recruitment 2026 (406 Posts)",
    "organization": "Punjab Subordinate Services Selection Board",
    "qualification": "10th Pass with Punjabi",
    "lastdate": "19 January 2026",
    "description": "OVERVIEW:\nPunjab Subordinate Services Selection Board (PSSSB) has released Group D Recruitment 2026 with a total of 406 vacancies for various support and attendant posts across departments in the Punjab government. Eligible candidates who have passed 10th class with Punjabi subject can apply online. 18\n\nELIGIBILITY & AGE:\n• 10th Pass with Punjabi language. 19\n• Age limit typically 18 to 37 years (category relaxation applicable). 20\n\nSELECTION PROCESS:\nSelection includes written examination followed by document verification. 21\n\nSALARY:\nPay scale ranges (Level‑1) with monthly pay approx ₹18,000–₹56,900 based on state pay matrix. 22\n\nहिंदी विवरण:\nPSSSB Group D भर्ती 2026 में 406 पदों के लिए उम्मीदवार आवेदन कर सकते हैं। योग्यता 10वीं पास और पंजाबी विषय अनिवार्य है। चयन लिखित परीक्षा और दस्तावेज जांच से होगा। वेतन ₹18,000–₹56,900 है।",
    "link": "https://sssb.punjab.gov.in"
  },
  {
    "category": "Punjab",
    "title": "PSSSB Clerk Recruitment 2026 (98 Posts)",
    "organization": "Punjab Subordinate Services Selection Board",
    "qualification": "Bachelor's Degree + Computer Course",
    "lastdate": "28 January 2026",
    "description": "OVERVIEW:\nPunjab Subordinate Services Selection Board (PSSSB) has released the Clerk Recruitment 2026 under Advt. 11/2025 for 98 vacancies including Clerk and Clerk IT positions. Candidates with a Bachelor's degree and computer qualification such as 120‑hour computer course or O‑Level Certificate are eligible to apply online by 28 January 2026. 23\n\nELIGIBILITY:\n• Bachelor's degree from a recognized university. 24\n• 120‑hour computer course or O Level Certificate mandatory. 25\n• Age Limit: 18–37 years (relaxation as per rules). 26\n\nSELECTION PROCESS:\nThe selection comprises written exam, typing test, and document verification. 27\n\nSALARY:\nMonthly pay scale approx ₹19,900/- with allowances. 28\n\nहिंदी विवरण:\nPSSSB क्लर्क भर्ती 2026 में 98 पदों के लिए आवेदन 28 जनवरी तक खुले हैं। उम्मीदवार के पास बैचलर डिग्री और कंप्यूटर कोर्स होना चाहिए। चयन में लिखित परीक्षा, टाइपिंग टेस्ट और दस्तावेज सत्यापन शामिल हैं।",
    "link": "https://sssb.punjab.gov.in"
  },
  {
    "category": "Admit Card",
    "title": "CTET Admit Card 2026 Released",
    "organization": "Central Board of Secondary Education (CBSE)",
    "qualification": "For CTET Paper I & II Candidates",
    "lastdate": "Exam as per admit card schedule",
    "description": "CTET 2026 admit cards are now released. Candidates can download using their application number and date of birth. The admit card contains exam date, shift timing, exam centre details and important instructions.\n\nहिंदी विवरण:\nCTET 2026 का एडमिट कार्ड जारी कर दिया गया है। उम्मीदवार आवेदन संख्या और जन्म तिथि का उपयोग करके डाउनलोड कर सकते हैं।",
    "link": "https://ctet.nic.in"
  },
  {
    "category": "Result",
    "title": "Punjab Police Constable Result 2025",
    "organization": "Punjab Police",
    "qualification": "-",
    "lastdate": "-",
    "description": "Punjab Police Constable exam result has been declared. Candidates can check their results online through the official portal.\n\nहिंदी विवरण:\nपंजाब पुलिस कांस्टेबल परीक्षा परिणाम घोषित कर दिया गया है। उम्मीदवार आधिकारिक वेबसाइट पर जाकर अपना परिणाम देख सकते हैं।",
    "link": "https://punjabpolice.gov.in"
  },
  {
    "category": "Latest",
    "title": "Indian Air Force Agniveer Vayu Intake 01/2027 Recruitment",
    "organization": "Indian Air Force",
    "qualification": "10+2 / Diploma / Vocational Course",
    "lastdate": "01 February 2026",
    "description": "OVERVIEW:\nIndian Air Force has released the Agniveer Vayu 01/2027 recruitment notification under the Agnipath Scheme. This recruitment invites unmarried male and female candidates for four years of service. Selection stages include online written exam, physical fitness tests, adaptability tests and medical examination.\n\nहिंदी विवरण:\nभारतीय वायु सेना ने अग्निवीर वायु 01/2027 भर्ती जारी की है। यह भर्ती चार वर्षों की सेवा के लिए अविवाहित पुरुष और महिलाओं के लिए है। चयन में लिखित परीक्षा, शार Ирिए physical fitness and medical checks are included.",
    "link": "https://agnipathvayu.cdac.in"
  }
]
