[
  {
    "category": "Latest",
    "title": "RRB Group D Recruitment 2026",
    "organization": "Railway Recruitment Board (RRB)",
    "qualification": "10th Pass / ITI",
    "lastdate": "Application opens from 30 January 2026",
    "description": "Event	Date
Notification (Short Notice)	December 2025 (issued)
Online Application Start	31 January 2026
Last Date to Apply	2 March 2026 (23:59 hrs)
Exam Date	Will be announced later
Admit Card Release	A few days before exam date

Note: The application window was postponed from the earlier date (21 Jan – 20 Feb) to the revised schedule above.

🎓 Eligibility Criteria

Educational Qualification

10th Pass (Matriculation) from a recognised board OR

ITI qualification / National Apprenticeship Certificate (NAC) from NCVT/SCVT (varies by post).
(This is the expected/reported criteria — always confirm with the detailed official notification when available.)

Age Limit

Minimum: 18 years

Maximum: ~33 years (as of 01.01.2026)

Age Relaxation: Applicable as per Govt rules (OBC/SC/ST/PwBD, etc.).

Nationality:

Only Indian citizens (or as specified in official notification) are eligible.

📋 Selection Process

Computer Based Test (CBT) – Single stage online written test.

Physical Efficiency Test (PET) – For candidates clearing CBT.

Document Verification (DV).

Medical Examination.

The detailed pattern (subjects/questions/marks) will be in the official full notification.

💰 Pay & Benefits

Starting Salary: Around ₹18,000 per month + allowances (approx). (Based on reports/trends; check official notification for exact pay scale.)

Government job benefits: PF/Gratuity, pension benefits (as per rules), transfers, promotions, etc.

📝 Application Fee

General/OBC/EWS: ~₹500 (partially refundable after CBT).

SC/ST/PwBD/Women/Transgender: ~₹250 (usually refundable after CBT).
(This is as reported; check official notification for exact fee and refund details.)

📌 How to Apply

Visit the official RRB website(s) or the centralized RRB application portal (like rrbapply.gov.in).

Read the full official notification (CEN 09/2025) carefully.

Fill the online application form with accurate details.

Upload required documents (photo, signature, certificates).

Pay fee (if applicable).

Submit before 2 March 2026, 23:59.

📍 Current Status (Jan 2026)

The admit card for the RRB Group D exam has started releasing for candidates whose exam is scheduled early February 2026.

Application process is ongoing for many candidates to complete by the revised deadline.

✅ Tips Before You Apply

Ensure Aadhaar details (name, DOB, photo) match your Class 10 certificate — required for verification.

Keep scanned copies of certificates ready.

Apply well before the deadline to avoid last-minute issues..\n\nThe selection process includes a Computer Based Test (CBT), followed by a Physical Efficiency Test (PET). Candidates who qualify PET will be called for Document Verification and Medical Examination. Final selection will be based on merit and fulfillment of eligibility criteria as prescribed by RRB.\n\nCandidates are advised to carefully read the official notification before applying and ensure that they meet all eligibility conditions related to age, education and medical standards.\n\n--------------------------------------\n\nहिंदी विवरण:\n\nरेलवे भर्ती बोर्ड (RRB) द्वारा ग्रुप D (लेवल-1) पदों के लिए भर्ती प्रक्रिया आयोजित की जाएगी। इस भर्ती के अंतर्गत ट्रैक मेंटेनर, हेल्पर, असिस्टेंट पॉइंट्समैन एवं अन्य तकनीकी और गैर-तकनीकी पदों पर नियुक्तियां की जाएंगी। यह भर्ती केंद्र सरकार की स्थायी नौकरी पाने का एक शानदार अवसर है।\n\nचयन प्रक्रिया में पहले कंप्यूटर आधारित परीक्षा (CBT) आयोजित की जाएगी। CBT में सफल उम्मीदवारों को शारीरिक दक्षता परीक्षा (PET) के लिए बुलाया जाएगा। PET के बाद दस्तावेज सत्यापन और मेडिकल जांच की जाएगी। अंतिम चयन मेरिट सूची के आधार पर किया जाएगा।\n\nउम्मीदवारों को आवेदन करने से पहले आधिकारिक अधिसूचना ध्यानपूर्वक पढ़ने की सलाह दी जाती है।",
    "link": "https://www.rrbapply.gov.in"
  },

  {
    "category": "Latest",
    "title": "Indian Air Force Agniveer Vayu Intake 01/2027 Recruitment",
    "organization": "Indian Air Force",
    "qualification": "10+2 (Science) / Diploma / Vocational Course",
    "lastdate": "01 February 2026",
    "description": "Indian Air Force has officially released the recruitment notification for Agniveer Vayu Intake 01/2027 under the Agnipath Scheme. This recruitment is conducted to enroll young and motivated candidates into the Indian Air Force for a service period of four years.\n\nThe selection process includes an online written examination, Physical Fitness Test (PFT), Adaptability Tests and Medical Examination. Selected candidates will receive monthly salary, allowances and a Seva Nidhi package after completion of service tenure.\n\nApplicants are advised to read the official notification carefully before applying to understand eligibility conditions, physical standards and selection rules.\n\n--------------------------------------\n\nहिंदी विवरण:\n\nभारतीय वायुसेना ने अग्निपथ योजना के अंतर्गत अग्निवीर वायु इंटेक 01/2027 के लिए आधिकारिक भर्ती अधिसूचना जारी कर दी है। इस भर्ती के माध्यम से योग्य एवं युवा उम्मीदवारों को चार वर्षों की सेवा अवधि के लिए भारतीय वायुसेना में शामिल किया जाएगा।\n\nचयन प्रक्रिया में ऑनलाइन लिखित परीक्षा, शारीरिक दक्षता परीक्षा, अनुकूलन परीक्षा और मेडिकल परीक्षण शामिल हैं। चयनित उम्मीदवारों को सेवा अवधि के दौरान वेतन, भत्ते तथा सेवा निधि पैकेज का लाभ मिलेगा।\n\nउम्मीदवारों को आवेदन करने से पहले आधिकारिक अधिसूचना को ध्यानपूर्वक पढ़ने की सलाह दी जाती है।",
    "link": "https://agnipathvayu.cdac.in"
  },

  {
    "category": "Latest",
    "title": "RBI Office Assistant Recruitment 2026",
    "organization": "Reserve Bank of India",
    "qualification": "10th / 12th Pass",
    "lastdate": "15 February 2026",
    "description": "Reserve Bank of India (RBI) has released the Office Assistant recruitment notification for 2026. This recruitment provides an excellent opportunity to work in India's central banking institution.\n\nThe selection process generally includes a written examination, interview and document verification. Selected candidates will receive an attractive salary, job security and other government benefits.\n\n--------------------------------------\n\nहिंदी विवरण:\n\nभारतीय रिज़र्व बैंक (RBI) द्वारा ऑफिस असिस्टेंट पदों के लिए भर्ती अधिसूचना जारी की गई है। यह भारत की सबसे प्रतिष्ठित बैंकिंग संस्थाओं में से एक में कार्य करने का अवसर प्रदान करती है।\n\nचयन प्रक्रिया में लिखित परीक्षा, साक्षात्कार और दस्तावेज सत्यापन शामिल हो सकता है। चयनित उम्मीदवारों को अच्छा वेतन, स्थायी नौकरी और अन्य सरकारी सुविधाएं प्राप्त होंगी।",
    "link": "https://rbi.org.in"
  },

  {
    "category": "Punjab",
    "title": "PSSSB Group D Recruitment 2026",
    "organization": "Punjab Subordinate Services Selection Board",
    "qualification": "10th Pass with Punjabi",
    "lastdate": "26 January 2026",
    "description": "Punjab Subordinate Services Selection Board (PSSSB) has released Group D recruitment notification for various departments of Punjab Government.\n\nThe selection process includes a written examination followed by document verification. Knowledge of Punjabi language is mandatory.\n\n--------------------------------------\n\nहिंदी विवरण:\n\nपंजाब अधीनस्थ सेवा चयन बोर्ड (PSSSB) द्वारा ग्रुप D पदों के लिए भर्ती अधिसूचना जारी की गई है। यह भर्ती पंजाब सरकार के विभिन्न विभागों में की जाएगी।\n\nचयन प्रक्रिया में लिखित परीक्षा और दस्तावेज सत्यापन शामिल होगा। उम्मीदवार का पंजाबी भाषा का ज्ञान होना अनिवार्य है।",
    "link": "https://sssb.punjab.gov.in"
  },

  {
    "category": "Admit Card",
    "title": "CTET Admit Card 2026 Released",
    "organization": "CBSE",
    "qualification": "CTET Paper I & II",
    "lastdate": "As per admit card",
    "description": "Central Teacher Eligibility Test (CTET) 2026 admit card has been released. Candidates can download their admit card using application number and date of birth.\n\nThe admit card contains important details such as exam date, timing, exam centre and instructions.\n\n--------------------------------------\n\nहिंदी विवरण:\n\nकेंद्रीय शिक्षक पात्रता परीक्षा (CTET) 2026 का एडमिट कार्ड जारी कर दिया गया है। उम्मीदवार आवेदन संख्या और जन्म तिथि की सहायता से एडमिट कार्ड डाउनलोड कर सकते हैं।\n\nएडमिट कार्ड में परीक्षा की तिथि, समय, परीक्षा केंद्र और महत्वपूर्ण निर्देश दिए गए हैं।",
    "link": "https://ctet.nic.in"
  },
{{
  "recruitment_name": "RRB Group D Recruitment 2026",
  "organization": "Railway Recruitment Board (RRB)",
  "ministry": "Ministry of Railways, Government of India",
  "cen_number": "CEN 09/2025",
  "post_level": "Level-1",
  "total_vacancies": 22000,
  "job_type": "Permanent Government Job",
  "job_location": "All India",
  "important_dates": {
    "notification_release": "December 2025",
    "application_start_date": "31 January 2026",
    "application_last_date": "02 March 2026",
    "exam_date": "To be announced",
    "admit_card": "Before exam date"
  },
  "eligibility": {
    "education": [
      "10th Pass (Matriculation)",
      "ITI from NCVT/SCVT",
      "National Apprenticeship Certificate (NAC)"
    ],
    "age_limit": {
      "minimum_age": 18,
      "maximum_age": 33,
      "age_calculation_date": "01 January 2026",
      "age_relaxation": "As per Government rules"
    },
    "nationality": "Indian"
  },
  "selection_process": [
    "Computer Based Test (CBT)",
    "Physical Efficiency Test (PET)",
    "Document Verification (DV)",
    "Medical Examination"
  ],
  "salary": {
    "pay_level": "Level-1",
    "basic_pay": 18000,
    "allowances": "As per Railway rules"
  },
  "application_fee": {
    "general_obc_ews": 500,
    "sc_st_pwd_women_transgender": 250,
    "refund_policy": "Fee partially/refully refundable after CBT"
  },
  "application_mode": "Online",
  "official_website": "https://www.rrbapply.gov.in",
  "current_status": "Applications open / ongoing",
  "notes": [
    "Check official notification for exact details",
    "Apply before last date to avoid server issues",
    "Aadhaar details should match 10th certificate"
}
]
